Revit 2027 API
ExternalDataManagerTool.SetChildCommandIds Method
 Sets the sub menu of the item
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetChildCommandIds(
	IList<ExternalDataManagerCommandId> childCommandIds
)
Public Sub SetChildCommandIds (
	childCommandIds As IList(Of ExternalDataManagerCommandId)
)
public:
void SetChildCommandIds(
	IList<ExternalDataManagerCommandId^>^ childCommandIds
)
member SetChildCommandIds :
        childCommandIds : IList<ExternalDataManagerCommandId> -> unit
Parameters
childCommandIds IList<ExternalDataManagerCommandId>
 The list of child command ids to associate with the tool.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerTool Class
Autodesk.Revit.UI Namespace